<!-- terraform-plan-comment -->
# Terraform Plan Results

**8 change(s):** 4 to create, 3 to update, 0 to replace, 1 to destroy

**❌ Resources will be destroyed or replaced**

## Resources to create:
- `databricks_grants.dbt_staging_schema`
- `databricks_mws_permission_assignment.dbt_cloud_staging`
- `databricks_schema.dbt_staging`
- `databricks_service_principal.dbt_cloud_staging`

## Resources to update:
- `databricks_grants.catalog_main`
- `databricks_permissions.cluster_classic`
- `databricks_permissions.token_usage`

## ❌ Resources to destroy:
- `databricks_permissions.sql_warehouse_starter`

<details>
<summary>Show diff</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # databricks_grants.catalog_main will be updated in-place
  ~ resource "databricks_grants" "catalog_main" {
        id      = "catalog/goodparty_data_catalog"
        # (1 unchanged attribute hidden)

      + grant {
          + principal  = (known after apply)
          + privileges = [
              + "SELECT",
              + "USE_CATALOG",
              + "USE_SCHEMA",
            ]
        }

        # (16 unchanged blocks hidden)
    }

  # databricks_grants.dbt_staging_schema will be created
  + resource "databricks_grants" "dbt_staging_schema" {
      + id     = (known after apply)
      + schema = (known after apply)

      + grant {
          + principal  = (known after apply)
          + privileges = [
              + "CREATE_TABLE",
              + "MODIFY",
              + "USE_SCHEMA",
            ]
        }
    }

  # databricks_mws_permission_assignment.dbt_cloud_staging will be created
  + resource "databricks_mws_permission_assignment" "dbt_cloud_staging" {
      + id           = (known after apply)
      + permissions  = [
          + "USER",
        ]
      + principal_id = (known after apply)
      + workspace_id = 3578414625112071
    }

  # databricks_permissions.cluster_classic will be updated in-place
  ~ resource "databricks_permissions" "cluster_classic" {
        id          = "/clusters/0409-211859-6hzpukya"
        # (2 unchanged attributes hidden)

      - access_control {
          - permission_level       = "CAN_RESTART" -> null
          - service_principal_name = "0f2fe566-8f33-4395-87dc-2b0c5063a7eb" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - permission_level       = "CAN_RESTART" -> null
          - service_principal_name = "a2538681-3f1d-49d4-a0bc-6c7b55c54674" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - permission_level       = "CAN_RESTART" -> null
          - service_principal_name = "d64bbff3-a0fb-42b8-bc0b-b0155274a61f" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - group_name             = "dbt-users" -> null
          - permission_level       = "CAN_RESTART" -> null
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + permission_level       = "CAN_RESTART"
          + service_principal_name = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + group_name       = "dbt-users"
          + permission_level = "CAN_RESTART"
        }
      + access_control {
          + permission_level       = "CAN_RESTART"
          + service_principal_name = "0f2fe566-8f33-4395-87dc-2b0c5063a7eb"
        }
      + access_control {
          + permission_level       = "CAN_RESTART"
          + service_principal_name = "a2538681-3f1d-49d4-a0bc-6c7b55c54674"
        }
      + access_control {
          + permission_level       = "CAN_RESTART"
          + service_principal_name = "d64bbff3-a0fb-42b8-bc0b-b0155274a61f"
        }
    }

  # databricks_permissions.sql_warehouse_starter will be destroyed
  # (because databricks_permissions.sql_warehouse_starter is not in configuration)
  - resource "databricks_permissions" "sql_warehouse_starter" {
      - id              = "/sql/warehouses/18583d8b081c6486" -> null
      - object_type     = "warehouses" -> null
      - sql_endpoint_id = "18583d8b081c6486" -> null

      - access_control {
          - permission_level       = "IS_OWNER" -> null
          - user_name              = "hugh@goodparty.org" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - group_name             = "users" -> null
          - permission_level       = "CAN_USE" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # databricks_permissions.token_usage will be updated in-place
  ~ resource "databricks_permissions" "token_usage" {
        id            = "/authorization/tokens"
        # (2 unchanged attributes hidden)

      - access_control {
          - permission_level       = "CAN_USE" -> null
          - service_principal_name = "24f016e2-6569-4b63-a2bf-9e7d34f7e7f1" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - permission_level       = "CAN_USE" -> null
          - service_principal_name = "dd9d5769-405e-46af-8f43-6cbd305bdb0c" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - group_name             = "dbt-users" -> null
          - permission_level       = "CAN_USE" -> null
            # (2 unchanged attributes hidden)
        }
      - access_control {
          - group_name             = "token-users" -> null
          - permission_level       = "CAN_USE" -> null
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + permission_level       = "CAN_USE"
          + service_principal_name = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + access_control {
          + group_name       = "dbt-users"
          + permission_level = "CAN_USE"
        }
      + access_control {
          + group_name       = "token-users"
          + permission_level = "CAN_USE"
        }
      + access_control {
          + permission_level       = "CAN_USE"
          + service_principal_name = "24f016e2-6569-4b63-a2bf-9e7d34f7e7f1"
        }
      + access_control {
          + permission_level       = "CAN_USE"
          + service_principal_name = "dd9d5769-405e-46af-8f43-6cbd305bdb0c"
        }
    }

  # databricks_schema.dbt_staging will be created
  + resource "databricks_schema" "dbt_staging" {
      + catalog_name                   = "goodparty_data_catalog"
      + comment                        = "Schema for dbt Cloud staging environment"
      + enable_predictive_optimization = (known after apply)
      + force_destroy                  = false
      + id                             = (known after apply)
      + metastore_id                   = (known after apply)
      + name                           = "dbt_staging"
      + owner                          = (known after apply)
      + properties                     = {
          + "managed_by" = "terraform"
          + "purpose"    = "dbt_staging"
        }
      + schema_id                      = (known after apply)
    }

  # databricks_service_principal.dbt_cloud_staging will be created
  + resource "databricks_service_principal" "dbt_cloud_staging" {
      + acl_principal_id           = (known after apply)
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + application_id             = (known after apply)
      + databricks_sql_access      = false
      + display_name               = "dbt_cloud_staging"
      + home                       = (known after apply)
      + id                         = (known after apply)
      + repos                      = (known after apply)
      + workspace_access           = false
      + workspace_consume          = false
    }

Plan: 4 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ astro_deployments    = {
      ~ dev  = {
            id            = "cml8n1tav1nxs01nd7ptp4tpm"
            name          = "astro-dev"
          ~ webserver_url = "cmgicqn2w002701mqfw3367w2.astronomer.run/dptp4tpm" -> "cml8n1tav1nxs01nd7ptp4tpm.pm.astronomer.run/dptp4tpm"
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged attribute hidden)
    }
```

</details>

---

<details>
<summary>What do these mean?</summary>

- **Create**: New resources will be added
- **Update**: Existing resources will be modified in-place
- **Replace**: Resources will be destroyed and recreated (data loss possible)
- **Destroy**: Resources will be permanently deleted

</details>

---

**To apply these changes:**

1. **Merge** this PR to `main`
2. **Review** the plan in the workflow run triggered by the merge
3. **Deploy** via Actions → Deploy → Run workflow → uncheck "Dry run"

Or via CLI after merge: `gh workflow run deploy.yaml -f dry_run=false`
